# SetContextualHelp Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RibbonItemData..::..SetContextualHelp Method
RibbonItemData Class See Also
---
Sets the contextual help bound with this button data.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetContextualHelp(
	ContextualHelp contextualHelp
)
```

Visual Basic
---
```text
Public Sub SetContextualHelp ( _
	contextualHelp As ContextualHelp _
)
```

Visual C++
---
```text
public:
void SetContextualHelp(
	ContextualHelp^ contextualHelp
)
```

# ### Parameters
contextualHelp
    Type: Autodesk.Revit.UI..::..ContextualHelpThe contextual help.
# See Also
RibbonItemData Class
Autodesk.Revit.UI Namespace